<?xml version="1.0" encoding="utf-8"?>
<policyDefinitions revision="0.1" schemaVersion="1.0">
	<policyNamespaces>
		<target prefix="mattermost" namespace="Mattermost.Policies"/>
	</policyNamespaces>
	<resources minRequiredRevision="0.1"/>
	<supportedOn>
		<definitions>
			<definition name="RequiresMattermost43" displayName="$(string.RequiresMattermost43)"/>
            <definition name="RequiresMattermost51" displayName="$(string.RequiresMattermost51)"/>
		</definitions>
	</supportedOn>
	<categories>
		<category displayName="$(string.mattermost)" name="mattermost"></category>
	</categories>
	<policies>
    	<policy name="EnableAutoUpdater" class="Machine" displayName="$(string.EnableAutoUpdater)" explainText="$(string.EnableAutoUpdaterDescription)" key="Software\Policies\Mattermost" valueName="EnableAutoUpdater">
			<parentCategory ref="mattermost"/>
			<supportedOn ref="RequiresMattermost51"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="EnableServerManagement" class="Both" displayName="$(string.EnableServerManagement)" explainText="$(string.EnableServerManagementDescription)" key="Software\Policies\Mattermost" valueName="EnableServerManagement">
			<parentCategory ref="mattermost"/>
			<supportedOn ref="RequiresMattermost43"/>
			<enabledValue>
				<decimal value="1"/>
			</enabledValue>
			<disabledValue>
				<decimal value="0"/>
			</disabledValue>
		</policy>
		<policy name="DefaultServerList" class="Both" displayName="$(string.DefaultServerList)" explainText="$(string.DefaultServerListDescription)" presentation="$(presentation.DefaultServerList)" key="Software\Policies\Mattermost">
			<parentCategory ref="mattermost" />
			<supportedOn ref="RequiresMattermost43" />
			<elements>
				<list id="DefaultServerList" key="Software\Policies\Mattermost\DefaultServerList" additive="true" explicitValue="true" />
			</elements>
		</policy>
	</policies>
</policyDefinitions>
